#include "derivative.h"      /* derivative-specific definitions */

#define CSn_L  PORTB_PB0  //左轮编码器片选
#define CSn_R  PORTB_PB6  //右轮编码器片选
#define CLK    PORTB_PB2  //读取时钟
#define DAT    PORTB_PB4  //数据输出
#define NB -3
#define NM -2
#define NS -1
#define O  0
#define PS 1
#define PM 2
#define PB 3




#define  BUS_CLOCK		   48000000	   //总线频率
#define  OSC_CLOCK		   16000000	   //晶振频率


#define MOTOR_DEAD_VAL 1// 电机死区 
#define MOTOR_OUT_MAX   2500
#define MOTOR_OUT_MIN  -2500

  //左电压 = 角度控制输出 + 速度控制量 -方向控制量+方向速度控制量
  extern int AngelControlOutput,PWML,PWMR;
  extern float g_fSpeedMotorOut ,g_fDirectionControlOut;//+DirectionSpeedControlOut;  

/*************************************************************/
/*                      初始化锁相环                           */
/*************************************************************/
void INIT_PLL(void) ;





/*************************************************************/
/*                      IO初始化                              */
/*************************************************************/
 void IO_init(void) ;







/*************************************************************/
/*                      编码器计数                         */
/*************************************************************/
void Count_Init(void);




/*************************************************************/
/*                      定时中产生1ms中断                         */
/*************************************************************/
void PIT_init(void);//定时中断初始化函数 1MS定时中断设置 







/*************************************************************/
/*                        PWM初始化                         */
/*************************************************************/
void PWM_Init(void);




/*************************************************************/
/*                        延时函数                           */
/*************************************************************/
void delay(void) ;







/*************************************************************/
/*                 初始化AD模块为12位精度                    */
/*************************************************************/
void INIT_AD12BIT(void) ;


/*************************************************************/
/*                                          电机输出                                               */
/*************************************************************/
void MotorSpeedOut(void);

    
  
